app/controllers/darts_controller.rb

SELECT "darts".* FROM "darts"
---
  def index
    @darts = Dart.all

SELECT "darts".* FROM "darts" WHERE "darts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @dart = Dart.find(params[:id])

INSERT INTO "darts" ("created_at", "name", "percentage", "size", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 08 May 2013 00:37:33 UTC +00:00], ["name", "testname"], ["percentage", 0.0], ["size", 1000], ["updated_at", Wed, 08 May 2013 00:37:33 UTC +00:00], ["url", "www.test.com"]]
---
  def upload_start
   @name = params[:name]
   @size = params[:size]

   @dart = Dart.new(:name=>@name, :size=>@size, :percentage=>0.0, :url => "www.test.com", :completed => false)

   respond_to do |format|
     if @dart.save

SELECT "darts".* FROM "darts" WHERE "darts"."token" = 'IJA8xK5k_1Wvv1VAcng1VA' LIMIT 1
UPDATE "darts" SET "percentage" = 25.0, "updated_at" = '2013-05-08 02:08:17.031922' WHERE "darts"."id" = 21
---
  def upload_update
    @token = params[:token]
    @uploaded = params[:uploaded]

    @dart = Dart.find_by_token(@token)

    if @dart
      @dart.percentage = @uploaded
      respond_to do |format|
         if @dart.save

SELECT "darts".* FROM "darts" WHERE "darts"."token" = 'IJA8xK5k_1Wvv1VAcng1VA' LIMIT 1
UPDATE "darts" SET "percentage" = 100.0, "completed" = 't', "updated_at" = '2013-05-08 18:07:11.487773' WHERE "darts"."id" = 22
---
  def upload_complete
    @token = params[:token]

    @dart = Dart.find_by_token(@token)

    if @dart
      @dart.percentage = 100.0
      @dart.completed = true
      respond_to do |format|
         if @dart.save

SELECT "darts".* FROM "darts" WHERE "darts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @dart = Dart.find(params[:id])

INSERT INTO "darts" ("created_at", "name", "percentage", "size", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 08 May 2013 00:35:25 UTC +00:00], ["name", "test"], ["percentage", 1.0], ["size", 1], ["updated_at", Wed, 08 May 2013 00:35:25 UTC +00:00], ["url", "www.www"]]
---
  def create
    @dart = Dart.new(params[:dart])

    respond_to do |format|
      if @dart.save

SELECT "darts".* FROM "darts" WHERE "darts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @dart = Dart.find(params[:id])

SELECT "darts".* FROM "darts" WHERE "darts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "darts" WHERE "darts"."id" = ?  [["id", 1]]
---
  def destroy
    @dart = Dart.find(params[:id])
    @dart.destroy